
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/Kei-14316/aws-ecs-terraform/actions/runs/5311134878)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00705fafb67416ba6]
data.aws_iam_policy_document.ecs_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
data.aws_iam_policy_document.ecs_task_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c661b72c943d34cf]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0ccc784c9055c020f]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d6790f3daeeb5af2]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e120b5943ce13fd3]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:targetgroup/go-simple-server-target-group/ced50aefa547e831]
aws_security_group.ecs: Refreshing state... [id=sg-018f5615248fac5d3]
aws_security_group.alb: Refreshing state... [id=sg-00b2d76cebaf84554]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0823a792b6fb3e653]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fcf88250150742d0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0857d48269364edf4]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a27c08df22168d27]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f50f6f3f1b1fbc59]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a8dd5606091c8e58]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0cb1d89834d1efa76]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-149721311]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f969679307de8b03]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-098b989a94826c17f]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:loadbalancer/app/go-simple-server-alb/9faac86c89754a65]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e120b5943ce13fd31080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a1fd1b9da79a3962]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-08d0fbc697d1c4745]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f05a32c2bffab542]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bdd15e6daf1cd3b9]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-09c6536cc626d05f7]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e42f5c98c2fee2e5]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0823a792b6fb3e6531080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0857d48269364edf41080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:listener/app/go-simple-server-alb/9faac86c89754a65/859430abd348cc2f]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:listener-rule/app/go-simple-server-alb/9faac86c89754a65/859430abd348cc2f/2939763c5964e1f1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "go-simple-server"
      + tags_all = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:529553035495:targetgroup/go-simple-server-target-group/ced50aefa547e831"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-018f5615248fac5d3",
            ]
          + subnets          = [
              + "subnet-0a8dd5606091c8e58",
              + "subnet-0cb1d89834d1efa76",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-simple-server"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs: Creating...
aws_iam_role.ecs_task: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs: Creation complete after 1s [id=go-simple-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role.ecs_task: Creation complete after 1s [id=go-simple-server-ecs-task]
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-simple-server-ecs-20230619111053828800000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:529553035495:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:529553035495:service/go-simple-server/go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"6ddc65798086b4f05f3a392ec9f0cc5087748bb7","Vars":{},"WorkflowName":"Terraform"} -->